; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v1)
             (pred_6 ?v9 ?v10)
             (pred_1 ?v8 ?v10)
             (pred_2 ?v6 ?v8 )
	     (pred_3 ?v8)
             (pred_5 ?v5)
             (pred_4 ?v9)
             (pred_8 ?v10)
             (pred_11 ?v8)
             (pred_7 ?v9)
             (pred_12 ?v8)
             (pred_9 ))



(:action op_1
:parameters (?v13 ?v4 ?v12 ?v11)
:precondition (and (pred_5 ?v13) (pred_5 ?v4) (pred_4 ?v12) (pred_8 ?v11)
          (pred_10 ?v13 ?v4) (pred_6 ?v12 ?v11)
                   (pred_1 ?v4 ?v11) (pred_3 ?v13) 
                   (pred_11 ?v4) (pred_7 ?v12))
:effect (and  (pred_12 ?v4) (not (pred_11 ?v4))))


(:action op_3
:parameters (?v13 ?v2)
:precondition (and (pred_5 ?v13) (pred_5 ?v2)
               (pred_3 ?v13) (pred_10 ?v13 ?v2) (pred_12 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v13))))

(:action op_2
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_4 ?v12) 
                  (pred_3 ?v13) (pred_2 ?v12 ?v13) (pred_9 ))
:effect (and (pred_7 ?v12)
   (not (pred_2 ?v12 ?v13)) (not (pred_9 ))))


(:action op_4
:parameters (?v13 ?v7 ?v3)
:precondition (and (pred_5 ?v13) (pred_4 ?v7) (pred_4 ?v3)
                  (pred_3 ?v13) (pred_7 ?v3) (pred_2 ?v7 ?v13))
:effect (and (pred_7 ?v7) (pred_2 ?v3 ?v13)
        (not (pred_7 ?v3)) (not (pred_2 ?v7 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_4 ?v12) 
                  (pred_3 ?v13) (pred_7 ?v12))
:effect (and (pred_9 ) (pred_2 ?v12 ?v13) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_11 obj_09 obj_17 obj_15 obj_14 obj_10 obj_05 obj_20 obj_19 obj_13 obj_02 obj_22 obj_16 obj_04 obj_01
    obj_06 obj_08 obj_18
    obj_07 obj_21 obj_03
    )

    (:init
       (pred_9)

       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_22)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_21)
       (pred_4 obj_03)

       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_14)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_15)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_20 obj_22)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_22 obj_20)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_04)
       (pred_11 obj_11)
       (pred_11 obj_05)
       (pred_11 obj_17)
       (pred_1  obj_11 obj_06)
       (pred_1  obj_05 obj_08)
       (pred_1  obj_17 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_22)
       (pred_12 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_01)

       (pred_6  obj_07 obj_06)
       (pred_6  obj_21 obj_08)
       (pred_6  obj_03 obj_18)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_03 obj_02)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_2 obj_07 obj_11)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_03 obj_19)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_3 obj_16 obj_04)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_04)
   goals met: 0 of 3
2. (op_3 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 0 of 3
3. (op_3 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 0 of 3
4. (op_2 obj_02 obj_21)
   deleted: (pred_2 obj_21 obj_02) (pred_9)
   added: (pred_7 obj_21)
   goals met: 0 of 3
5. (op_1 obj_02 obj_05 obj_21 obj_08)
   deleted: (pred_11 obj_05)
   added: (pred_12 obj_05)
   goals met: 0 of 3
6. (op_3 obj_02 obj_05)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_05)
   goals met: 0 of 3
7. (op_5 obj_05 obj_21)
   deleted: (pred_7 obj_21)
   added: (pred_9) (pred_2 obj_21 obj_05)
   goals met: 0 of 3
8. (op_3 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_02)
   goals met: 0 of 3
9. (op_2 obj_02 obj_03)
   deleted: (pred_2 obj_03 obj_02) (pred_9)
   added: (pred_7 obj_03)
   goals met: 0 of 3
10. (op_3 obj_02 obj_05)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_05)
   goals met: 0 of 3
11. (op_3 obj_05 obj_10)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_10)
   goals met: 0 of 3
12. (op_3 obj_10 obj_09)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_09)
   goals met: 0 of 3
13. (op_4 obj_09 obj_07 obj_03)
   deleted: (pred_7 obj_03) (pred_2 obj_07 obj_09)
   added: (pred_7 obj_07) (pred_2 obj_03 obj_09)
   goals met: 0 of 3
14. (op_1 obj_09 obj_11 obj_07 obj_06)
   deleted: (pred_11 obj_11)
   added: (pred_12 obj_11)
   goals met: 0 of 3
15. (op_3 obj_09 obj_10)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_10)
   goals met: 0 of 3
16. (op_5 obj_10 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_9) (pred_2 obj_07 obj_10)
   goals met: 0 of 3
17. (op_3 obj_10 obj_05)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_05)
   goals met: 0 of 3
18. (op_2 obj_05 obj_21)
   deleted: (pred_2 obj_21 obj_05) (pred_9)
   added: (pred_7 obj_21)
   goals met: 0 of 3
19. (op_3 obj_05 obj_10)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_10)
   goals met: 0 of 3
20. (op_4 obj_10 obj_07 obj_21)
   deleted: (pred_7 obj_21) (pred_2 obj_07 obj_10)
   added: (pred_7 obj_07) (pred_2 obj_21 obj_10)
   goals met: 0 of 3
21. (op_3 obj_10 obj_09)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_09)
   goals met: 0 of 3
22. (op_3 obj_09 obj_11)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_11)
   goals met: 0 of 3
23. (op_5 obj_11 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_9) (pred_2 obj_07 obj_11)
   goals met: 1 of 3
24. (op_3 obj_11 obj_14)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_14)
   goals met: 1 of 3
25. (op_3 obj_14 obj_10)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_10)
   goals met: 1 of 3
26. (op_2 obj_10 obj_21)
   deleted: (pred_2 obj_21 obj_10) (pred_9)
   added: (pred_7 obj_21)
   goals met: 1 of 3
27. (op_3 obj_10 obj_09)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_09)
   goals met: 1 of 3
28. (op_4 obj_09 obj_03 obj_21)
   deleted: (pred_7 obj_21) (pred_2 obj_03 obj_09)
   added: (pred_7 obj_03) (pred_2 obj_21 obj_09)
   goals met: 1 of 3
29. (op_3 obj_09 obj_10)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_10)
   goals met: 1 of 3
30. (op_3 obj_10 obj_14)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_14)
   goals met: 1 of 3
31. (op_3 obj_14 obj_19)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_19)
   goals met: 1 of 3
32. (op_5 obj_19 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_9) (pred_2 obj_03 obj_19)
   goals met: 2 of 3
33. (op_3 obj_19 obj_14)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_14)
   goals met: 2 of 3
34. (op_3 obj_14 obj_11)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_11)
   goals met: 2 of 3
35. (op_3 obj_11 obj_09)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_09)
   goals met: 2 of 3
36. (op_2 obj_09 obj_21)
   deleted: (pred_2 obj_21 obj_09) (pred_9)
   added: (pred_7 obj_21)
   goals met: 2 of 3
37. (op_3 obj_09 obj_11)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_11)
   goals met: 2 of 3
38. (op_3 obj_11 obj_12)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_12)
   goals met: 2 of 3
39. (op_3 obj_12 obj_15)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_15)
   goals met: 2 of 3
40. (op_3 obj_15 obj_20)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_20)
   goals met: 2 of 3
41. (op_5 obj_20 obj_21)
   deleted: (pred_7 obj_21)
   added: (pred_9) (pred_2 obj_21 obj_20)
   goals met: 3 of 3
